function atm=atmosphere(H,t0)
% Модель стандартної атмосфери 
% Висоти: 0 - 11000 м
% function atm=atmosphere([H,[to]])
%
% H - поточна висота [0]
% t0 - температура повітря на рівні моря, С [15]
% atm - запис з полями властивостей атмосфери
% 
  if H > 11000,
    H=11000;
  end;

  % Константи
  % Температура у Кельвінах
  TK0 = 273.15;
  % Щільність повітря на рівні моря
  rho0= 1.225; 
  % Тиск на рівні моря
  P0=101325.0;
  % Гравітаційна постійна
  g=9.80665;
  % Газова постійна
  R=287.058;
  % Температура на рівні моря
  t0std=15;
      
  atm=struct();
  
  atm.H = H;
  atm.t0=t0;
  atm.t=atm.t0-0.0065*atm.H;
  atm.T0=atm.t0+TK0;
  atm.T=atm.t+TK0;
  atm.P=P0*(1-0.0065*atm.H/atm.T0)^(5.2561);
  atm.rho=atm.P/(R*atm.T);
  atm.a=sqrt(1.4*R*atm.T);

